# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install fish
brew 'fish'

# Install exa. A modern replacement to ls
brew 'exa'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'
brew 'ripgrep'
brew 'fzf'

# Install Binaries
brew 'hub'
brew 'tree'
brew 'trash'
brew 'wget'

# Development
brew 'git'
brew 'vim'
brew 'node'
brew 'go'
cask 'docker'
brew 'git-delta'
brew 'macdown'
brew 'google-cloud-sdk'
brew 'k3d'
brew 'kubectl'
brew 'skaffold'
brew 'helm'
brew 'k9s'

# Apps
cask 'aerial'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'github-desktop'
cask 'google-chrome'
cask 'iterm2'
cask 'spotify'
cask 'tower'
cask 'transmit'
cask 'vlc'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-inconsolata'
cask 'font-fira-code'
